ankuns/nrfx/bsp/stable/mdk/nrf7140_ml_peripherals.h
/*GSI*/
#define GSI_PRESENT 1
#define GSI_COUNT 1

#define GSI_GSI_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NUM_CLOCK_POWER_PAIR_MAX 1           /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NUM_CLOCK_POWER_PAIR_SIZE 2          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define GSI_GSI_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */
#define GSI_FPGA 0                                   /*!< (unspecified)                                                        */

/*DISPC*/
#define DISPC_PRESENT 1
#define DISPC_COUNT 1

#define DISPC_IRQ_COUNT 3
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_MIN 0       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_MAX 1       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NUM_CLOCK_POWER_PAIR_SIZE 2      /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define DISPC_DISPC_NOTFULLPCPZERO 1                 /*!< (unspecified)                                                        */

/*GPU*/
#define GPU_PRESENT 1
#define GPU_COUNT 1

#define GPU_GPU_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NUM_CLOCK_POWER_PAIR_MAX 1           /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NUM_CLOCK_POWER_PAIR_SIZE 2          /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define GPU_GPU_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */

/*Trace buffer monitor*/
#define TBM_PRESENT 1
#define TBM_COUNT 1

/*USBHS*/
#define USBHS_PRESENT 1
#define USBHS_COUNT 1

#define USBHS_SIMULATIONREGISTERS 0                  /*!< (unspecified)                                                        */

/*MRAM controller*/
#define MRAMC_PRESENT 1
#define MRAMC_COUNT 2

#define MRAMC110_NMRAMWORDSIZE 128                   /*!< (unspecified)                                                        */
#define MRAMC110_NMRAMPAGESIZE 4                     /*!< (unspecified)                                                        */
#define MRAMC110_NNVRPAGESIZE 4                      /*!< (unspecified)                                                        */
#define MRAMC110_NMAINMEMORYSIZE 2                   /*!< MRAM main memory size: 2 MB                                          */
#define MRAMC110_NNVRPAGES_MIN 0                     /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC110_NNVRPAGES_MAX 3                     /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC110_NNVRPAGES_SIZE 4                    /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC110_NSIZEMRAMWORDS_MIN 1                /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC110_NSIZEMRAMWORDS_MAX 131072           /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC110_NSIZEMRAMWORDS_SIZE 131073          /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC110_MARMDATAWIDTHWORDS_MIN 0            /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC110_MARMDATAWIDTHWORDS_MAX 3            /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC110_MARMDATAWIDTHWORDS_SIZE 4           /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC110_NVRPAGEUPPER 1                      /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELOWER 1                      /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGEENABLENORMALWRITE 1          /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEBITS_MIN 24            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEBITS_MAX 27            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEBITS_SIZE 28           /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZERESET 15               /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEVALUE_MIN 0            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEVALUE_MAX 15           /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELRSIZEVALUE_SIZE 16          /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEBITS_MIN 28            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEBITS_MAX 31            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEBITS_SIZE 32           /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZERESET 15               /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEVALUE_MIN 0            /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEVALUE_MAX 15           /*!< (unspecified)                                                        */
#define MRAMC110_NVRPAGELWSIZEVALUE_SIZE 16          /*!< (unspecified)                                                        */
#define MRAMC110_IMPROVEDBURSTMODE 1                 /*!< (unspecified)                                                        */

#define MRAMC111_NMRAMWORDSIZE 128                   /*!< (unspecified)                                                        */
#define MRAMC111_NMRAMPAGESIZE 4                     /*!< (unspecified)                                                        */
#define MRAMC111_NNVRPAGESIZE 4                      /*!< (unspecified)                                                        */
#define MRAMC111_NMAINMEMORYSIZE 2                   /*!< MRAM main memory size: 2 MB                                          */
#define MRAMC111_NNVRPAGES_MIN 0                     /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC111_NNVRPAGES_MAX 3                     /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC111_NNVRPAGES_SIZE 4                    /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC111_NSIZEMRAMWORDS_MIN 1                /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC111_NSIZEMRAMWORDS_MAX 131072           /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC111_NSIZEMRAMWORDS_SIZE 131073          /*!< Register ERASE.SIZE.SIZE range: 1..131072                            */
#define MRAMC111_MARMDATAWIDTHWORDS_MIN 0            /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC111_MARMDATAWIDTHWORDS_MAX 3            /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC111_MARMDATAWIDTHWORDS_SIZE 4           /*!< Register TESTMODE2.MRAM.DATA/DATAINC size: 0..3                      */
#define MRAMC111_NVRPAGEUPPER 0                      /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELOWER 0                      /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGEENABLENORMALWRITE 1          /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEBITS_MIN 24            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEBITS_MAX 27            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEBITS_SIZE 28           /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZERESET 15               /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEVALUE_MIN 0            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEVALUE_MAX 15           /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELRSIZEVALUE_SIZE 16          /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEBITS_MIN 28            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEBITS_MAX 31            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEBITS_SIZE 32           /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZERESET 15               /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEVALUE_MIN 0            /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEVALUE_MAX 15           /*!< (unspecified)                                                        */
#define MRAMC111_NVRPAGELWSIZEVALUE_SIZE 16          /*!< (unspecified)                                                        */
#define MRAMC111_IMPROVEDBURSTMODE 1                 /*!< (unspecified)                                                        */

/*External Memory Interface*/
#define EXMIF_PRESENT 1
#define EXMIF_COUNT 1

/*OTP controller*/
#define OTPC_PRESENT 1
#define OTPC_COUNT 1

#define OTPC_REGION_NO_EXTENSION 0                   /*!< (unspecified)                                                        */
#define OTPC_REGION_EXTENSION 1                      /*!< (unspecified)                                                        */
#define OTPC_TESTMODE_WRITEBACK_EVENT 0              /*!< (unspecified)                                                        */
#define OTPC_NREGIONS_MIN 0                          /*!< Number of OTP regions : 0..5                                         */
#define OTPC_NREGIONS_MAX 5                          /*!< Number of OTP regions : 0..5                                         */
#define OTPC_NREGIONS_SIZE 6                         /*!< Number of OTP regions : 0..5                                         */
#define OTPC_REGION0ADDR 797179904                   /*!< Region 0 address : 797179904, size: 768 Bytes                        */
#define OTPC_REGION0SIZE 768                         /*!< (unspecified)                                                        */
#define OTPC_REGION1ADDR 797180672                   /*!< Region 1 address : 797180672, size: 256 Bytes                        */
#define OTPC_REGION1SIZE 256                         /*!< (unspecified)                                                        */
#define OTPC_REGION2ADDR 797180928                   /*!< Region 2 address : 797180928, size: 768 Bytes                        */
#define OTPC_REGION2SIZE 768                         /*!< (unspecified)                                                        */
#define OTPC_REGION3ADDR 797181696                   /*!< Region 3 address : 797181696, size: 768 Bytes                        */
#define OTPC_REGION3SIZE 768                         /*!< (unspecified)                                                        */
#define OTPC_REGION4ADDR 797182464                   /*!< Region 4 address : 797182464, size: 512 Bytes                        */
#define OTPC_REGION4SIZE 512                         /*!< (unspecified)                                                        */
#define OTPC_REGION5ADDR 797182976                   /*!< Region 5 address : 797182976, size: 13312 Bytes                      */
#define OTPC_REGION5SIZE 13312                       /*!< (unspecified)                                                        */

/*SD-Card and eMMC*/
#define SDCARD_PRESENT 1
#define SDCARD_COUNT 1

#define SDCARD_SDCARD_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by PCGC Slave - [gsi_numpcp]        */
#define SDCARD_SDCARD_NUM_CLOCK_POWER_PAIR_MAX 1     /*!< Number of clock/power pairs used by PCGC Slave - [gsi_numpcp]        */
#define SDCARD_SDCARD_NUM_CLOCK_POWER_PAIR_SIZE 2    /*!< Number of clock/power pairs used by PCGC Slave - [gsi_numpcp]        */
#define SDCARD_SDCARD_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */

/*MUTEX*/
#define MUTEX_PRESENT 1
#define MUTEX_COUNT 2

/*Prototype HW information registers.*/
#define PROTOTYPEINFO_PRESENT 1
#define PROTOTYPEINFO_COUNT 1

